<?php
/* Äà ñå ñúñòàâè ïðîãðàìà, ÷ðåç êîÿòî ñå èçâåæäà êâàäðàò îò
öèôðè. Ñóìèòå îò åëåìåíòèòå íà ïðîèçâîëåí ðåä èëè ñòúëá ñà
ðàâíè íà 45. 
Ïðèìåð:
1 2 3 4 5 6 7 8 9 0
2 3 4 5 6 7 8 9 0 1
3 4 5 6 7 8 9 0 1 2
4 5 6 7 8 9 0 1 2 3
5 6 7 8 9 0 1 2 3 4
6 7 8 9 0 1 2 3 4 5
7 8 9 0 1 2 3 4 5 6
8 9 0 1 2 3 4 5 6 7                                                                               òåë.: +359 888 911 186
9 0 1 2 3 4 5 6 7 8
0 1 2 3 4 5 6 7 8 9                  
*/

$len = 10;

for ($row = 1; $row <= $len; $row++) {
	for ($col = 0; $col < $len; $col++) {
		$value = $row + $col;
		
		if ($value == $len) {
			echo '0 ';
		} else {
			if ($value > $len){
				$value -= $len;
			}
			echo $value . ' ';
		}
	}
	echo PHP_EOL;
}